apache/nuttx/arch/arm/src/common/stm32/hardware/stm32_dma_v1_8ch.h
#  define DMACHAN_SPI2_TX         STM32_DMA1_CHAN5
#  define DMACHAN_USART1_RX       STM32_DMA1_CHAN5
#  define DMACHAN_I2C2_RX         STM32_DMA1_CHAN5
#  define DMACHAN_TIM2_CH1        STM32_DMA1_CHAN5
#  define DMACHAN_TIM4_CH3        STM32_DMA1_CHAN5
#  define DMACHAN_TIM18_UP        STM32_DMA1_CHAN5
#  define DMACHAN_DAC2_CH1        STM32_DMA1_CHAN5
#  define DMACHAN_TIM15_CH1       STM32_DMA1_CHAN5
#  define DMACHAN_TIM15_UP        STM32_DMA1_CHAN5
#  define DMACHAN_TIM15_TRIG      STM32_DMA1_CHAN5
#  define DMACHAN_TIM15_COM       STM32_DMA1_CHAN5

#  define DMACHAN_USART2_RX       STM32_DMA1_CHAN6
#  define DMACHAN_I2C1_TX         STM32_DMA1_CHAN6
#  define DMACHAN_TIM3_CH1        STM32_DMA1_CHAN6
#  define DMACHAN_TIM3_TRIG       STM32_DMA1_CHAN6
#  define DMACHAN_TIM16_CH1_2     STM32_DMA1_CHAN6
#  define DMACHAN_TIM16_UP_2      STM32_DMA1_CHAN6

#  define DMACHAN_USART2_TX       STM32_DMA1_CHAN7
#  define DMACHAN_I2C1_RX         STM32_DMA1_CHAN6
#  define DMACHAN_TIM2_CH2        STM32_DMA1_CHAN6
#  define DMACHAN_TIM2_CH4        STM32_DMA1_CHAN6
#  define DMACHAN_TIM4_UP         STM32_DMA1_CHAN6
#  define DMACHAN_TIM17_CH1_2     STM32_DMA1_CHAN6
#  define DMACHAN_TIM17_UP_2      STM32_DMA1_CHAN6

#  define DMACHAN_SPI3_RX         STM32_DMA2_CHAN1
#  define DMACHAN_TIM5_CH4        STM32_DMA2_CHAN1
#  define DMACHAN_TIM5_TRIG       STM32_DMA2_CHAN1

#  define DMACHAN_SPI3_TX         STM32_DMA2_CHAN2
#  define DMACHAN_TIM5_CH3        STM32_DMA2_CHAN2
#  define DMACHAN_TIM5_UP         STM32_DMA2_CHAN2

#  define DMACHAN_SDADC1          STM32_DMA2_CHAN3
#  define DMACHAN_TIM6_UP_2       STM32_DMA2_CHAN3
#  define DMACHAN_DAC1_CH1_2      STM32_DMA2_CHAN3

#  define DMACHAN_SDADC2          STM32_DMA2_CHAN4
#  define DMACHAN_TIM5_CH2        STM32_DMA2_CHAN4
#  define DMACHAN_TIM7_UP_2       STM32_DMA2_CHAN4
#  define DMACHAN_DAC1_CH2_2      STM32_DMA2_CHAN4

#  define DMACHAN_SDADC3          STM32_DMA2_CHAN5
#  define DMACHAN_TIM5_CH1        STM32_DMA2_CHAN5
#  define DMACHAN_TIM18_UP_2      STM32_DMA2_CHAN5
#  define DMACHAN_DAC2_CH1_2      STM32_DMA2_CHAN5

#elif defined(CONFIG_STM32_STM32G4XXX)

/* This family uses a DMAMUX. The code to support this needs to be ported
 * to this family from STM32L4R.
 */

#else
#  error "Unknown DMA channel assignments"
#endif

#endif /* __ARCH_ARM_SRC_COMMON_STM32_HARDWARE_STM32_DMA_V1_8CH_H */
